konsgn/MKL27_Arduino/system/CMSIS/devices/MKL27Z644/fsl_device_headers.h
#ifndef __FSL_DEVICE_HEADERS_H__
#define __FSL_DEVICE_HEADERS_H__


// Includes all the fsl headers that can be included from the drivers folder.

#include "drivers/fsl_adc16.h"
#include "drivers/fsl_clock.h"
#include "drivers/fsl_cmp.h"
#include "drivers/fsl_common.h"
#include "drivers/fsl_cop.h"
#include "drivers/fsl_crc.h"
#include "drivers/fsl_dma.h"
#include "drivers/fsl_dmamux.h"
#include "drivers/fsl_flash.h"
#include "drivers/fsl_flexio.h"
#include "drivers/fsl_flexio_i2c_master.h"
#include "drivers/fsl_flexio_i2s_dma.h"
#include "drivers/fsl_flexio_i2s.h"
#include "drivers/fsl_flexio_spi_dma.h"
#include "drivers/fsl_flexio_spi.h"
#include "drivers/fsl_flexio_uart_dma.h"
#include "drivers/fsl_flexio_uart.h"
#include "drivers/fsl_gpio.h"
#include "drivers/fsl_i2c_dma.h"
#include "drivers/fsl_i2c_freertos.h"
#include "drivers/fsl_i2c.h"
#include "drivers/fsl_llwu.h"
#include "drivers/fsl_lptmr.h"
#include "drivers/fsl_lpuart_dma.h"
#include "drivers/fsl_lpuart_freertos.h"
#include "drivers/fsl_lpuart.h"
#include "drivers/fsl_pit.h"
#include "drivers/fsl_pmc.h"
#include "drivers/fsl_port.h"
#include "drivers/fsl_rcm.h"
#include "drivers/fsl_rtc.h"
#include "drivers/fsl_sim.h"
#include "drivers/fsl_smc.h"
#include "drivers/fsl_spi_dma.h"
#include "drivers/fsl_spi_freertos.h"
#include "drivers/fsl_spi.h"
#include "drivers/fsl_tpm.h"
#include "drivers/fsl_uart_dma.h"
#include "drivers/fsl_uart_freertos.h"
#include "drivers/fsl_uart.h"
#include "drivers/fsl_vref.h"


#endif
